tap "charmbracelet/tap"
tap "common-fate/granted"
tap "daveshanley/vacuum"
tap "fluxcd/tap"
tap "followtheprocess/tap"
tap "go-gremlins/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "kluctl/tap"
tap "nao1215/tap"
tap "taiki-e/tap"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "node"
brew "action-docs"
brew "actionlint"
brew "atuin"
brew "aws-sam-cli"
brew "awscli"
brew "bash"
brew "bat"
brew "carapace"
brew "cargo-nextest"
brew "gcc"
brew "openblas"
brew "checkov"
brew "cue"
brew "curl"
brew "dagger"
brew "delve"
brew "difftastic"
brew "dust"
brew "erdtree"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "gomodifytags"
brew "graphviz"
brew "gum"
brew "hadolint"
brew "helm"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "k6"
brew "k9s"
brew "ko"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "make"
brew "marp-cli"
brew "mas"
brew "mdbook"
brew "minikube"
brew "nushell"
brew "pandoc"
brew "pinentry-mac"
brew "procs"
brew "pyrefly"
brew "ripgrep"
brew "ruby"
brew "ruff"
brew "solargraph"
brew "starship"
brew "staticcheck"
brew "stow"
brew "syft"
brew "television"
brew "terraform-docs"
brew "tflint"
brew "tldr"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "trivy"
brew "typos-cli"
brew "uv"
brew "vhs"
brew "wget"
brew "yq"
brew "zig"
brew "zls"
brew "zoxide"
brew "charmbracelet/tap/freeze"
brew "common-fate/granted/granted"
brew "daveshanley/vacuum/vacuum"
brew "fluxcd/tap/flux"
brew "go-gremlins/tap/gremlins"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "kluctl/tap/kluctl"
brew "nao1215/tap/gup"
brew "taiki-e/tap/cargo-llvm-cov"
cask "1password-cli"
cask "container"
cask "docker-desktop"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "ghostty"
cask "git-rekt"
cask "goreleaser"
cask "gowc"
cask "logi-options+"
cask "notion"
cask "raycast"
cask "slack"
cask "spok"
cask "spotify"
cask "tag"
cask "txtract"
cask "visual-studio-code"
cask "wireshark-app"
cask "zed"
cask "zen"
cask "zoom"
mas "AdGuard for Safari", id: 1440147259
mas "Bear", id: 1091189122
mas "Dropover", id: 1355679052
mas "Noir", id: 1592917505
mas "Things", id: 904280696
mas "WhatsApp", id: 310633997
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "griimick.vhs"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "njpwerner.autodocstring"
vscode "patbenatar.advanced-new-file"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "semanticdiff.semanticdiff"
vscode "tamasfe.even-better-toml"
vscode "tekumara.typos-vscode"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "twpayne.vscode-testscript"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
go "golang.org/x/perf/cmd/benchstat"
go "github.com/dkorunic/betteralign/cmd/betteralign"
go "github.com/nametake/golangci-lint-langserver"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "go.uber.org/nilaway/cmd/nilaway"
go "golang.org/x/pkgsite/cmd/pkgsite"
go "golang.org/x/tools/cmd/present"
go "golang.org/x/tools/cmd/stringer"
go "github.com/mfridman/tparse"
