tap "charmbracelet/tap", trusted: true
tap "common-fate/granted", trusted: true
tap "felixkratz/formulae", trusted: true
tap "fluxcd/tap", trusted: true
tap "followtheprocess/tap", trusted: true
tap "go-task/tap", trusted: true
tap "goreleaser/tap", trusted: true
tap "hashicorp/tap", trusted: true
tap "kluctl/tap", trusted: true
tap "nao1215/tap", trusted: true
tap "nikitabobko/tap", trusted: true
tap "olets/tap", trusted: true
tap "shaunsingh/sfmono-nerd-font-ligaturized", trusted: true
tap "taiki-e/tap", trusted: true
tap "theboredteam/boring-notch", trusted: true
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Generate docs for GitHub actions
brew "action-docs"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Multi-shell multi-command argument completer
brew "carapace"
# Next-generation test runner for Rust
brew "cargo-nextest"
# GNU compiler collection
brew "gcc"
# Optimized BLAS library
brew "openblas"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Cross-platform make
brew "cmake"
# CLI-tool for cooking recipes formated using Cooklang
brew "cookcli"
# Container Signing
brew "cosign"
# Validate and define text-based and dynamic configuration
brew "cue"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Portable devkit for CI/CD pipelines
brew "dagger"
# Debugger for the Go programming language
brew "delve"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Language server for Dockerfiles, Compose files, and Bake files
brew "docker-language-server"
# More intuitive version of du in rust
brew "dust"
# Multi-threaded file-tree visualizer and disk usage analyzer
brew "erdtree"
# Modern, maintained replacement for ls
brew "eza"
# Powerful, lightweight programming language
brew "lua"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Tool for working with usage-spec CLIs
brew "usage"
# Fort Knox for your secrets - flexible secret management tool
brew "fnox"
# Command-line fuzzy finder written in Go
brew "fzf"
# Replace zsh completion selection menu with fzf
brew "fzf-tab"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for `golangci-lint`
brew "golangci-lint-langserver"
# Go tool to modify struct field tags
brew "gomodifytags"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tool for glamorous shell scripts
brew "gum"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Build and deploy Go applications on Kubernetes
brew "ko"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Mac App Store command-line interface
brew "mas"
# Create modern online books from Markdown files
brew "mdbook"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Modern shell for the GitHub era
brew "nushell"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Documentation server for Go packages
brew "pkgsite"
# Modern replacement for ps written in Rust
brew "procs"
# Your all-in-one OpenAPI utility
brew "redocly-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Markdown Linter and Formatter written in Rust
brew "rumdl"
# Autoformat shell script source code
brew "shfmt"
# Ruby language server
brew "solargraph"
# Cross-shell prompt for astronauts
brew "starship"
# State of the art linter for the Go programming language
brew "staticcheck"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# General purpose fuzzy finder TUI
brew "television"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform Language Server
brew "terraform-ls"
# Linter for Terraform files
brew "tflint"
# Official tldr client written in Rust
brew "tlrc"
# Program that allows you to count code, quickly
brew "tokei"
# TOML formatter, linter and language server
brew "tombi"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Source code spell checker
brew "typos-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Your CLI home video recorder
brew "vhs"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Generate images of code and terminal output.
brew "charmbracelet/tap/freeze"
# The easiest way to access your cloud.
brew "common-fate/granted/granted"
# A window border system for macOS
brew "felixkratz/formulae/borders",  restart_service: :changed, start_service: true
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar",  restart_service: :changed, start_service: true
# Flux CLI
brew "fluxcd/tap/flux"
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task"
# Terraform
brew "hashicorp/tap/terraform"
# kluctl
brew "kluctl/tap/kluctl"
# gup - Update binaries installed by 'go install'
brew "nao1215/tap/gup"
# Auto-expanding abbreviations manager for zsh, inspired by fish
brew "olets/tap/zsh-abbr"
# Cargo subcommand for LLVM source-based code coverage (-C instrument-coverage)
brew "taiki-e/tap/cargo-llvm-cov"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Not so boring notch That Rocks 🎸🎶
cask "theboredteam/boring-notch/boring-notch"
# Desktop client for brain.fm
cask "brainfm"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-geist"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "font-inter"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# A profoundly unhelpful git extension
cask "followtheprocess/tap/git-rekt"
# Release engineering, simplified
cask "goreleaser/tap/goreleaser"
# Implementation of wc in Go
cask "followtheprocess/tap/gowc"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# It's a build system Jim, but not as we know it!
cask "followtheprocess/tap/spok"
# Music streaming service
cask "spotify"
# The all in one semver management tool
cask "followtheprocess/tap/tag"
# A CLI to interact with txtar archive files
cask "followtheprocess/tap/txtract"
# REST, GraphQL and gRPC client
cask "yaak"
# Multiplayer code editor
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Dropover", id: 1355679052
mas "JSON Peep", id: 1458969831
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 361285480
mas "Noir", id: 1592917505
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Refined GitHub", id: 1519867270
mas "Things", id: 904280696
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
go "golang.org/x/perf/cmd/benchstat"
go "github.com/dkorunic/betteralign/cmd/betteralign"
go "golang.org/x/tools/gopls"
go "golang.org/x/vuln/cmd/govulncheck"
go "go.uber.org/nilaway/cmd/nilaway"
go "golang.org/x/tools/cmd/present"
go "golang.org/x/tools/cmd/stringer"
go "github.com/mfridman/tparse"
cargo "cargo-update"
cargo "cargo-zigbuild"
cargo "nu_plugin_dns"
cargo "nu_plugin_formats"
cargo "rustlings"
uv "aws-sam-cli"
uv "copier"
uv "httpie"
uv "nox"
uv "ty"
