tap "charmbracelet/tap"
tap "common-fate/granted"
tap "fluxcd/tap"
tap "followtheprocess/tap"
tap "go-gremlins/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "kluctl/tap"
tap "nao1215/tap"
tap "taiki-e/tap"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz"
brew "node"
brew "action-docs"
brew "shellcheck"
brew "actionlint"
brew "atuin"
brew "aws-sam-cli"
brew "awscli"
brew "bash"
brew "bat"
brew "carapace"
brew "cargo-nextest"
brew "gcc"
brew "openblas"
brew "checkov"
brew "cosign"
brew "cue"
brew "curl"
brew "dagger"
brew "delve"
brew "difftastic"
brew "direnv"
brew "dust"
brew "erdtree"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "glab"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "gomodifytags"
brew "graphviz"
brew "gum"
brew "hadolint"
brew "helm"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "k6"
brew "k9s"
brew "ko"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "make"
brew "marp-cli"
brew "mas"
brew "mdbook"
brew "minikube"
brew "nushell"
brew "pandoc"
brew "pinentry-mac"
brew "procs"
brew "pyrefly"
brew "redocly-cli"
brew "ripgrep"
brew "ruby"
brew "ruff"
brew "rumdl"
brew "shfmt"
brew "solargraph"
brew "starship"
brew "staticcheck"
brew "stow"
brew "syft"
brew "television"
brew "terraform-docs"
brew "terraform-ls"
brew "tflint"
brew "tlrc"
brew "tokei"
brew "tree"
brew "tree-sitter"
brew "trivy"
brew "typos-cli"
brew "uv"
brew "vhs"
brew "wget"
brew "yq"
brew "zig"
brew "zls"
brew "zoxide"
brew "charmbracelet/tap/freeze"
brew "common-fate/granted/granted"
brew "fluxcd/tap/flux"
brew "go-gremlins/tap/gremlins"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
brew "kluctl/tap/kluctl"
brew "nao1215/tap/gup"
brew "taiki-e/tap/cargo-llvm-cov"
cask "1password-cli"
cask "container"
cask "docker-desktop"
cask "font-geist-mono"
cask "font-geist-mono-nerd-font"
cask "ghostty"
cask "git-rekt"
cask "goreleaser"
cask "gowc"
cask "logi-options+"
cask "raycast"
cask "slack"
cask "spok"
cask "spotify"
cask "tag"
cask "txtract"
cask "yaak"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Bear", id: 1091189122
mas "Dropover", id: 1355679052
mas "JSON Peep", id: 1458969831
mas "Keynote", id: 409183694
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Refined GitHub", id: 1519867270
mas "Things", id: 904280696
mas "WhatsApp", id: 310633997
go "golang.org/x/perf/cmd/benchstat"
go "github.com/dkorunic/betteralign/cmd/betteralign"
go "github.com/nametake/golangci-lint-langserver"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/josharian/impl"
go "go.uber.org/nilaway/cmd/nilaway"
go "golang.org/x/pkgsite/cmd/pkgsite"
go "golang.org/x/tools/cmd/present"
go "golang.org/x/tools/cmd/stringer"
go "github.com/mfridman/tparse"
