tap "aws/tap"
tap "common-fate/granted"
tap "followtheprocess/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lucagrulla/tap"
tap "minamijoyo/tfupdate"
tap "nao1215/tap"
tap "omissis/go-jsonschema"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
brew "actionlint"
brew "xz"
brew "openssl@3"
brew "node"
brew "aws-cdk"
brew "readline"
brew "sqlite"
brew "aws-sam-cli"
brew "python@3.12"
brew "awscli"
brew "awscurl"
brew "bat"
brew "bzip2"
brew "cargo-llvm-cov"
brew "cargo-nextest"
brew "cfn-lint"
brew "gcc"
brew "openblas"
brew "checkov"
brew "cloudformation-cli"
brew "cue"
brew "curl"
brew "direnv"
brew "dive"
brew "dust"
brew "erdtree"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gdbm"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gum"
brew "helix"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "make"
brew "marp-cli"
brew "mcfly"
brew "neovim"
brew "nushell"
brew "openjdk"
brew "pandoc"
brew "pinentry-mac"
brew "pkl"
brew "procs"
brew "pyflow"
brew "python-launcher"
brew "python@3.11"
brew "rain"
brew "ripgrep"
brew "ruff"
brew "rye"
brew "shellcheck"
brew "silicon"
brew "sonar-scanner"
brew "starship"
brew "syft"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "trivy"
brew "typos-cli"
brew "uv"
brew "vhs"
brew "wget"
brew "yank"
brew "yq"
brew "zig"
brew "zlib"
brew "zls"
brew "zoxide"
brew "common-fate/granted/granted"
brew "followtheprocess/tap/goignore"
brew "followtheprocess/tap/gowc"
brew "followtheprocess/tap/spok"
brew "followtheprocess/tap/tag"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform"
brew "lucagrulla/tap/cw"
brew "minamijoyo/tfupdate/tfupdate"
brew "nao1215/tap/gup"
brew "omissis/go-jsonschema/go-jsonschema"
cask "1password"
cask "alacritty", args: { appdir: "~/Applications" }
cask "arc", args: { appdir: "~/Applications" }
cask "aws-vpn-client", args: { appdir: "~/Applications" }
cask "docker", args: { appdir: "~/Applications" }
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "ghostty"
cask "iterm2", args: { appdir: "~/Applications" }
cask "obsidian", args: { appdir: "~/Applications" }
cask "postman"
cask "raycast", args: { appdir: "~/Applications" }
cask "spotify"
cask "teamviewer"
cask "visual-studio-code"
cask "zed"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "followtheprocess.spok"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "griimick.vhs"
vscode "gruntfuggly.todo-tree"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "njpwerner.autodocstring"
vscode "patbenatar.advanced-new-file"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "semanticdiff.semanticdiff"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
