tap "aws/tap"
tap "followtheprocess/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lucagrulla/tap"
tap "minamijoyo/tfupdate"
tap "nao1215/tap"
tap "omissis/go-jsonschema"
brew "actionlint"
brew "xz"
brew "openssl@3"
brew "node"
brew "aws-cdk"
brew "readline"
brew "sqlite"
brew "aws-sam-cli"
brew "awscli"
brew "awscurl"
brew "bat"
brew "bzip2"
brew "cargo-nextest"
brew "cfn-lint"
brew "gcc"
brew "openblas"
brew "checkov"
brew "cloudformation-cli"
brew "cue"
brew "curl"
brew "direnv"
brew "docker"
brew "dust"
brew "erdtree"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gdbm"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "gleam"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gum"
brew "helix"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "make"
brew "marp-cli"
brew "mcfly"
brew "neovim"
brew "openjdk"
brew "pandoc"
brew "pinentry-mac"
brew "pkl"
brew "procs"
brew "pyflow"
brew "python-launcher"
brew "rain"
brew "ripgrep"
brew "ruff"
brew "rye"
brew "shellcheck"
brew "silicon"
brew "sonar-scanner"
brew "starship"
brew "syft"
brew "terraform-docs"
brew "tflint"
brew "tfsec"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "trivy"
brew "uv"
brew "vhs"
brew "wget"
brew "yank"
brew "yq"
brew "zlib"
brew "zoxide"
brew "followtheprocess/tap/goignore"
brew "followtheprocess/tap/gowc"
brew "followtheprocess/tap/spok"
brew "followtheprocess/tap/tag"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform"
brew "lucagrulla/tap/cw"
brew "minamijoyo/tfupdate/tfupdate"
brew "nao1215/tap/gup"
brew "omissis/go-jsonschema/go-jsonschema"
cask "1password"
cask "alacritty", args: { appdir: "~/Applications" }
cask "arc", args: { appdir: "~/Applications" }
cask "aws-vpn-client", args: { appdir: "~/Applications" }
cask "iterm2", args: { appdir: "~/Applications" }
cask "obsidian", args: { appdir: "~/Applications" }
cask "postman"
cask "raycast", args: { appdir: "~/Applications" }
cask "spotify"
cask "teamviewer"
cask "visual-studio-code"
