tap "aws/tap"
tap "followtheprocess/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "lucagrulla/tap"
tap "minamijoyo/tfupdate"
tap "omissis/go-jsonschema"
brew "actionlint"
brew "xz"
brew "openssl@3"
brew "node"
brew "aws-cdk"
brew "readline"
brew "sqlite"
brew "cfn-lint"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "bzip2"
brew "gcc"
brew "openblas"
brew "cargo-nextest"
brew "checkov"
brew "cloudformation-cli"
brew "curl"
brew "docker", link: false
brew "dust"
brew "erdtree"
brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gdbm"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gum"
brew "helix"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "make"
brew "marp-cli"
brew "neovim"
brew "openjdk"
brew "pandoc"
brew "pinentry-mac"
brew "procs"
brew "pyenv"
brew "pyflow"
brew "python-launcher"
brew "rain"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tflint"
brew "tfsec"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "trivy"
brew "vhs"
brew "wget"
brew "yank"
brew "zlib"
brew "zoxide"
brew "mcfly"
brew "followtheprocess/tap/goignore"
brew "followtheprocess/tap/spok"
brew "followtheprocess/tap/tag"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform"
brew "lucagrulla/tap/cw"
brew "minamijoyo/tfupdate/tfupdate"
brew "omissis/go-jsonschema/go-jsonschema"
cask "docker", args: { appdir: "~/Applications" }
cask "font-fira-code-nerd-font"
cask "google-drive"
cask "postman", args: { appdir: "~/Applications" }
cask "raycast", args: { appdir: "~/Applications" }
cask "slack", args: { appdir: "~/Applications" }
cask "warp", args: { appdir: "~/Applications" }
cask "whatsapp", args: { appdir: "~/Applications" }
vscode "42Crunch.vscode-openapi"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "DavidAnson.vscode-markdownlint"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "FollowTheProcess.spok"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "kddejong.vscode-cfn-lint"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "njpwerner.autodocstring"
vscode "patbenatar.advanced-new-file"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "semanticdiff.semanticdiff"
vscode "skellock.just"
vscode "SmartBearSoftware.vscode-swaggerhub"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
