tap "1password/tap"
tap "aws/tap"
tap "followtheprocess/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nao1215/tap"
tap "omissis/go-jsonschema"
tap "sondr3/taps"
tap "taiki-e/tap"
brew "actionlint"
brew "xz"
brew "openssl@3"
brew "bat"
brew "bzip2"
brew "readline"
brew "sqlite"
brew "cargo-nextest"
brew "cue"
brew "curl"
brew "dependabot"
brew "direnv"
brew "dust"
brew "erdtree"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gum"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "make"
brew "node"
brew "marp-cli"
brew "mas"
brew "mcfly"
brew "nushell"
brew "openblas"
brew "openjdk"
brew "pandoc"
brew "pinentry-mac"
brew "pkl"
brew "procs"
brew "ripgrep"
brew "ruff"
brew "silicon"
brew "starship"
brew "syft"
brew "tldr"
brew "tokei"
brew "tree"
brew "typos-cli"
brew "uv"
brew "vhs"
brew "wget"
brew "yank"
brew "zlib"
brew "zoxide"
brew "followtheprocess/tap/git-rekt"
brew "followtheprocess/tap/goignore"
brew "followtheprocess/tap/gowc"
brew "followtheprocess/tap/ignorers"
brew "followtheprocess/tap/spok"
brew "followtheprocess/tap/tag"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform"
brew "nao1215/tap/gup"
brew "omissis/go-jsonschema/go-jsonschema"
brew "sondr3/taps/git-ignore"
brew "taiki-e/tap/cargo-llvm-cov"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "arc"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
mas "Adblock Plus", id: 1432731683
mas "Dropover", id: 1355679052
mas "JSONPeep", id: 1458969831
mas "Magnet", id: 441258766
mas "Noir", id: 1592917505
mas "Refined GitHub", id: 1519867270
mas "Things", id: 904280696
