tap "1password/tap"
tap "aws/tap"
tap "cantino/mcfly"
tap "cargo-lambda/cargo-lambda"
tap "followtheprocess/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "sondr3/taps"
tap "taiki-e/tap"
brew "actionlint"
brew "xz"
brew "node"
brew "aws-cdk"
brew "readline"
brew "sqlite"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "bzip2"
brew "curl"
brew "dust"
brew "erdtree"
brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "helix"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "make"
brew "marp-cli"
brew "openblas"
brew "openssl@3"
brew "pandoc"
brew "pinentry-mac"
brew "procs"
brew "pyenv"
brew "pyflow"
brew "python-launcher"
brew "rain"
brew "ripgrep"
brew "starship"
brew "syft"
brew "tldr"
brew "tokei"
brew "tree"
brew "wget"
brew "yank"
brew "zlib"
brew "zoxide"
brew "cantino/mcfly/mcfly"
brew "cargo-lambda/cargo-lambda/cargo-lambda"
brew "followtheprocess/tap/goignore"
brew "followtheprocess/tap/gowc"
brew "followtheprocess/tap/ignorers"
brew "followtheprocess/tap/spok"
brew "followtheprocess/tap/tag"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "sondr3/taps/git-ignore"
brew "taiki-e/tap/cargo-llvm-cov"
cask "1password-cli"
cask "iterm2"
cask "lofi"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "charliermarsh.ruff"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "FollowTheProcess.spok"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "njpwerner.autodocstring"
vscode "patbenatar.advanced-new-file"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "semanticdiff.semanticdiff"
vscode "skellock.just"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wart.ariake-dark"
vscode "yzhang.markdown-all-in-one"
