tap "1password/tap"
tap "aws/tap"
tap "followtheprocess/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nao1215/tap"
tap "omissis/go-jsonschema"
tap "sondr3/taps"
tap "taiki-e/tap"
brew "actionlint"
brew "xz"
brew "openssl@3"
brew "bat"
brew "bzip2"
brew "readline"
brew "sqlite"
brew "cargo-nextest"
brew "cue"
brew "curl"
brew "dependabot"
brew "direnv"
brew "dust"
brew "erdtree"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gum"
brew "hugo"
brew "hyperfine"
brew "jq"
brew "just"
brew "make"
brew "node"
brew "marp-cli"
brew "mcfly"
brew "openblas"
brew "pandoc"
brew "pinentry-mac"
brew "pkl"
brew "procs"
brew "ripgrep"
brew "ruff"
brew "silicon"
brew "starship"
brew "syft"
brew "tldr"
brew "tokei"
brew "tree"
brew "uv"
brew "vhs"
brew "wget"
brew "yank"
brew "zig"
brew "zlib"
brew "zoxide"
brew "followtheprocess/tap/git-rekt"
brew "followtheprocess/tap/goignore"
brew "followtheprocess/tap/gowc"
brew "followtheprocess/tap/ignorers"
brew "followtheprocess/tap/spok"
brew "followtheprocess/tap/tag"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/terraform"
brew "nao1215/tap/gup"
brew "omissis/go-jsonschema/go-jsonschema"
brew "sondr3/taps/git-ignore"
brew "taiki-e/tap/cargo-llvm-cov"
cask "1password-cli"
cask "arc"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
vscode "asdine.cue"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "followtheprocess.spok"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "golang.go"
vscode "griimick.vhs"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "njpwerner.autodocstring"
vscode "patbenatar.advanced-new-file"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "semanticdiff.semanticdiff"
vscode "skellock.just"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
